In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
cols = ["name","age","gender","job"]
cols

In [ ]:
user1 = pd.DataFrame([["alice",19,"f","student"],["john",26,"m","student"]],columns = cols)

In [ ]:
user1

In [ ]:
user2 = pd.DataFrame([["eric",22,"m","student"],["paul",58,"f","manager"]],columns = cols)

In [ ]:
user2

In [ ]:
user3 = pd.DataFrame(dict(name=["peter","julie"],age=[33,44],
                          gender=["m","f"],job=["engineer","scientist"]))

In [ ]:
user3

In [ ]:
user1.append(user2) # Concatenation operation

In [ ]:
user1.append(user2.append(user3))

In [ ]:
users = pd.concat([user1,user2,user3])
users

In [ ]:
type(users)
users.head() # Prints the first 5 rows
#users.tail() # Prints the last 5 rows

In [ ]:
users.values

In [ ]:
a = users[users.age < 20]
a

In [ ]:
a_boolean = users.age < 20
a_boolean

In [ ]:
users[users.age < 20][["age","job"]]

In [ ]:
users[users.job.isin(["student","engineer"])]

In [ ]:
users.age.sort_values()

In [ ]:
users.sort_values(by="age")

In [ ]:
users.sort_values(by="age",ascending=False)

In [ ]:
users.sort_values(by=["job","age"])

In [ ]:
x = np.linspace(0,10)
a = np.sin(x)
plt.plot(x, a)
plt.show()

In [ ]:
plt.plot(x, a, "o")
plt.xlabel('This is x ')
plt.ylabel('This is y')
plt.show()

In [45]:
import pandas as pd
try:
    salary = pd.read_csv("d:/CSV/salary_table.csv")
except:
    url = "https://raw.github.com/duchesnay/pylearn-doc/master/data/salary_table.csv"
    salary = pd.read_csv(url)
df = salary

In [43]:
df

    salary  experience education management
0    13876           1  Bachelor          Y
1    11608           1      Ph.D          N
2    18701           1      Ph.D          Y
3    11283           1    Master          N
4    11767           1      Ph.D          N
5    20872           2    Master          Y
6    11772           2    Master          N
7    10535           2  Bachelor          N
8    12195           2      Ph.D          N
9    12313           3    Master          N
10   14975           3  Bachelor          Y
11   21371           3    Master          Y
12   19800           3      Ph.D          Y
13   11417           4  Bachelor          N
14   20263           4      Ph.D          Y
15   13231           4      Ph.D          N
16   12884           4    Master          N
17   13245           5    Master          N
18   13677           5      Ph.D          N
19   15965           5  Bachelor          Y
20   12336           6  Bachelor          N
21   21352           6      Ph.D          Y
22   13839           6    Master          N
23   22884           6    Master          Y
24   16978           7  Bachelor          Y
25   14803           8    Master          N
26   17404           8  Bachelor          Y
27   22184           8      Ph.D          Y
28   13548           8  Bachelor          N
29   14467          10  Bachelor          N
30   15942          10    Master          N
31   23174          10      Ph.D          Y
32   23780          10    Master          Y
33   25410          11    Master          Y
34   14861          11  Bachelor          N
35   16882          12    Master          N
36   24170          12      Ph.D          Y
37   15990          13  Bachelor          N
38   26330          13    Master          Y
39   17949          14    Master          N
40   25685          15      Ph.D          Y
41   27837          16    Master          Y
42   18838          16    Master          N
43   17483          16  Bachelor          N
44   19207          17    Master          N
45   19346          20  Bachelor          N

In [46]:
# Random forest
# Load the library with the iris dataset
from sklearn.datasets import load_iris
# Load scikit's random forest classifier library
from sklearn.ensemble import RandomForestClassifier
import numpy as np # Load numpy
np.random.seed(0) # Set random seed

In [47]:
# Create an object called iris with the iris data
iris = load_iris()
# Create a dataframe with the four feature variables
df = pd.DataFrame(iris.data, columns=iris.feature_names)
# View the top 5 rows
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2